Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja1/trygve_s.html.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 1 .
nob: Artikkel i boka Samisk skolehistorie 1 .

source: Norgga sámeskuvlla birra
nob: Om sameskolen i Norge

source: Odd Mathis Hætta jearahallá
nob: Intervjua av Odd Mathis Hætta Oversatt av Svein Lund

source: Trygve Madsen iežas barttas Basevuovddis , Kárášjogas , beassážiid 2004 .
nob: Trygve Madsen på hytta i Basevuovdi , Karasjok , påska 2004 .

source: Dán bihtá mii leat gávdnan oahppogirjjis Giellamet - kursbok i lapska språket för Nordens samer , maid Nils Erik Hansegård lea redigeren ja maid Sveriges Radios förlag almmuhii 1968:s .
nob: Dette stykket har vi funnet i læreboka Giellamet - kursbok i lapska språket för Nordens samer , som Nils Erik Hansegård redigerte og som Sveriges Radios förlag ga ut i 1968 .

source: Jurdda dáinna bihtáin lei čilget eará riikkaid sámiide mo sámiid skuvladilli lei Norggas .
nob: Tanken med dette stykket var å fortelle samer i andre land hvordan samenes skoleforhold var i Norge .

source: Danin lea álggos čilgejuvvon erohus Norgga ja Ruoŧa sámiid skuvlafálaldagaid gaskkas , go dalle ledje Ruoŧas sierra sámeskuvllat .
nob: Derfor er det i starten lagt vekt på å vise forskjellen fra Sverige , der det var egne skoler for reindriftssamer .

source: Artihkkal addá hui buori gova das mo dilli lei dalle go sámegiel álgooahpahus álggahuvvui ja mo oahpaheaddjit jurddašedje .
nob: Det gir et svært godt bilde av hvordan forholda var nettopp da samisk begynneropplæring blei satt i gang , og hvordan lærerne da tenkte .

source: Trygve Madsen lei dalle Kárášjoga mánáidskuvlla jođiheaddjin .
nob: Trygve Madsen var den gang rektor på Karasjok barneskole .

source: Son lea riegádan 1928:s , ja bajásšaddan Guovdageainnus .
nob: Han er født i 1928 , oppvokst i Kautokeino .

source: Sus lea oahpaheaddjioahppu ja sámegiela vuođđofága .
nob: Han har lærerutdanning og samisk grunnfag .

source: Son lea bargan oahpaheaddjin ja rektorin , Sámi Radios ja Sámi dáiddárservviid čállingottis .
nob: Trygve Madsen har arbeida som lærer og rektor , i sameradioen og som sekretær for de samiske kunstnerorganisasjonene .

source: Dál son lea penšunista ja orru Hønefossas .
nob: Nå er han pensjonist og bor på Hønefoss .

source: Jearahalli Odd Mathis Hætta lea Guovdageainnus eret , riegádan 1940:s ja bargá dál Finnmárkku allaskuvllas historjjáoahpaheaddjin .
nob: Intervjueren , Odd Mathis Hætta , er fra Kautokeino , født i 1940 og arbeider nå som lærer i historie ved Høgskolen i Finnmark .

source: Son lea ee. bargan vuođđoskuvlaoahpaheaddjin , Finnmárkku skuvladirektevrakántuvrra konsuleantan ja Sámi Radio hoavdan .
nob: Han har bl.a. arbeida som grunnskolelærer , konsulent for skoledirektøren i Finnmark og leder for Sámi Radio .

source: Son lea doaimmahan aviisa Ságat ja čállán ollu girjjiid .
nob: Han har vært redaktør for avisa Ságat og skrevet ei rekke bøker .

source: Doaimmaheaddji Nils Erik Hansegård ( 1918-2002 ) lei oahpaheaddji ja gielladutki Ruoŧas ja čálii máŋga girjji guovttegielatvuođa ja sámi ja suoma gielladiliid birra .
nob: Redaktøren Nils Erik Hansegård ( 1918-2002 ) var lærer og språkforsker i Sverige og skreiv mange bøker om tospråklighet og samiske og finske språkforhold .

source: Dát bihttá čállojuvvui vuos dalá čállinvuogi mielde ( Bergsland-Ruong ) .
nob: Artikkelen er opprinnelig skrevet på samisk i den skrivemåten som blei brukt på 1960-tallet ( Bergsland-Ruong ) .

source: Siri Broch Johansen lea transkriberen dan dálá čállinvuohkái .
nob: Den samiske utgava er her transkribert til gjeldende rettskriving .

source: Dás leat sihkkon muhtin gielalaš čilgehusaid mat ledje mielde Giellamet-girjjis .
nob: Vi har strøket noen ordforklaringer som var med fordi det skulle brukes i ei lærebok .

source: Faksimila čájeha mo bihttá prentejuvvui .
nob: Ellers er hele teksten gjengitt her .

source: - Movt lea dáppe Norggas dat sámeskuvla leamaš organiserejuvvon ?
nob: - Hvordan har sameskolen vært organisert her i Norge ?

source: - Dáppe Norggas lea oktasaš skuvlaláhka sihke sámiide ja dážaide ( norgalaččaide ) .
nob: - Her i Norge er det felles skole både for samer og ikke-samer ( nordmenn ) .

source: Dat leat dan seammá skuvlla vázzán buohkat áiggi čađa .
nob: De har til alle tider gått i den samme skolen .

source: Muhto lea okta boares instruksa 1898:s , mii mearrida ahte sámegiella sáhttá geavahuvvot veahkkegiellan , jos dárbbašuvvo ja beare dalle go skuvlamánát eai ádde maid oahpaheaddji dadjá .
nob: Men det er en gammel instruks helt fra 1898 som avgjør at samisk kan brukes som hjelpespråk , dersom det trengst og bare når skolebarna ikke forstår hva læreren sier .

source: Diet lea maŋŋil soađi rievdaduvvon : skuvlaláhkii lea dál váldojuvvon dat , ahte sámegiella sáhttá geavahuvvot oahppangiellan nai .
nob: Denne blei endra etter krigen : nå er det tatt inn i skoleloven at samisk kan brukes også som undervisningsspråk .

source: Ii dat sáhte dadjat , ahte dat leat čuvvon dan boares mearrádusa ( 1898 rájes ) .
nob: Man kan ikke si at den gamle bestemmelsen ( fra 1898 ) blei fulgt .

source: Mu skuvlaáiggis Guovdageainnus , mis lei oahpaheaddji mii geavahii sámegiela ollu , ii beare veahkkegiellan , muhto maiddái oahpahusgiellan .
nob: I min skoletid i Kautokeino hadde vi en lærer som brukte samisk mye , ikke bare som hjelpespråk , men også som undervisningsspråk .

source: Ja fertii maid , go mánát ledje buohkat sámegielalaččat , ja eanáš eai ádden veaháš ge dárogiela .
nob: Og det måtte han også , for barna var alle samiskspråklige . Og de fleste forsto ikke det minste norsk .

source: Ja nu dat lea veaháš mannan bajás vulos dađi mielde go leat oahpaheaddjit leamaš .
nob: Og slik har det gått litt opp og ned etter som det har vært lærere .

source: Ovdal soađi dáppe ledje máŋgga sajis oahpaheaddjit geat máhtte sámegiela .
nob: Før krigen var her mange steder lærere som kunne samisk .

source: Eai máhttán dalle go bohte , muhto ohppe dađi mielde go orro dáppe .
nob: De kunne det ikke da de kom , men de lærte etter hvert som de bodde her .

source: Ja lei hui uhccán johtu oahpaheddjiid gaskkas dalle , nu ahte dat oahpaheaddjit geat bohte , orro máŋggaid jagiid , muhtumin moaddelot jagi maiddái .
nob: Og det var så liten gjennomtrekk blant lærerne i den tida at de lærerne som kom , de bodde i mange år , noen ganger også i flere tiår .

source: Muhto dieđusge , eai mánát oahppan nu ollu go dál ja dasa lea sivvan ovddimus skuvlaáigi .
nob: Men sjølsagt lærte ikke barna så mye som nå , og den viktigste grunnen til det er skoletida .

source: Mis lei ovdal soađi nu gohčoduvvon unnimus skuvlaáigi ( 12 vahkku jagis ) .
nob: Før krigen hadde vi såkalt minste skoletid ( 12 uker for året ) .

source: Gielddat Sis-Finnmárkkus leat dieđusge geafit ja dat fertejedje válljet dan buot unnimus skuvlaáiggi .
nob: Kommunene i Indre Finnmark var sjølsagt fattige , og de måtte velge den aller korteste skoletida .

source: Dalle go mun vázzen skuvlla Guovdageainnus , mun vázzen 6 vahkku čakčat ja 6 vahkku giđđat .
nob: Da jeg gikk på skole i Kautokeino , gikk jeg 6 uker om høsten og 6 uker om våren .

source: Dálvet de vázze dat badjeolbmot .
nob: Om vinteren gikk flyttsamene .

source: Internáhtta lei dan mađe unni ( stuoris dat gal lei muhto almmatge dan mađe unni ) : eai čáhkan buot mánát oktanaga dohko .
nob: Internatet var så lite ( stort var det , men likevel såpass lite ) , at alle barna ikke fikk plass der samtidig .

source: Jos dál olbmot , mat ovdal soađi vázze skuvlla , máhttet uhccán dárogiela , dat eanáš boahtá dás , ahte dat lei nu uhcci dat skuvlaáigi .
nob: Hvis de folka som gikk på skole før krigen kan lite norsk , kommer det mest av det at skoletida var så kort . Faksimile av starten på artikkelen , slik han sto i læreboka " Giellamet "

source: - Ledje go dáppe Norggas ( dego Ruoŧas leat leamaš ) dakkár katekehtat , oahpaheaddjit mat čuvvo johttisámiid mielde , dalle go dat johte ?
nob: - Var det her ( slik som det har vært i Sverige ) slike kateketer , lærere som fulgte med flyttsamene , når de flytta ?

source: - Nu go mun orun muitimin , de gávdnojedje dáppe maid muhtimat dakkárat 18. dahje 19. jahkečuođis .
nob: - Som jeg mener å huske , fantest det her noen slike på 17- eller 1800-tallet .

source: Muhto eanáš lei nu , ahte skuvlamánát bohte márkaniidda ja giliide ja doppe vázze skuvlla .
nob: Men for det meste var det slik at skolebarna kom til kirkestedene og bygdene og gikk på skole der .

source: Álggus dat orro olbmuid luhtte , oainnat , go eai lean viesut , muhto ovccinuppelot čuođi njealjis – vai lei go viđas 25 ?
nob: Først bodde de hos folk , ser du , når det ikke var hus , men i 1904 , eller var det 1905 , blei det bygd det første internatet for samebarn , og det var i Kautokeino .

source: – de huksejuvvui vuosttaš internáhtta sámemánáid várás , ja dat lei Guovdageainnus .
nob: [ Internatet blei påbegynt i 1905 , men var ikke ferdig før i 1907 og blei tatt i bruk fra januar 1908 .

source: Juohke sámegielddas lea dál internáhtta , nu go dáppe Kárášjogas .
nob: Hver samekommune har nå internat , slik som her i Karasjok .

source: Čuohte máná čáhket dohko .
nob: Det har plass til hundre barn .

source: Muhto eai leat nu ollu gal mat dál fertejit internáhttii go ovdal .
nob: Men det er ikke så mange som må på internatet nå som før .

source: Oainnat , mii leat goit geainnuid ožžon dál ja mis lea dáppe skuvlasáhttu , mii vuojiha mánáid ; njeallje busse mat juohke beaivvi vuojihit mánáid .
nob: Vi har jo fått veier nå , og vi har skoleskyss . Vi frakter barna ; fire busser som hver dag kjører barn .

source: Dál lea skuvlaáigi uhcimus 27 vahkku jagis ja eanáš mánát vázzet 38 vahkku .
nob: Nå er skoletida minst 27 uker i året og de fleste barn går 38 uker .

source: Ja dat dieđusge dahká hirbmat ollu .
nob: Og det gjør sjølsagt svært mye .

source: Ovdalaš áiggi lei čiežajahkásaš bággoskuvla ; dál lea ovccijahkásaš bággoskuvla ja vel logát jagi oažžut vázzit friija , jos dáhttut .
nob: Før i tida var det sju års obligatorisk skole , nå er det 9 år obligatorisk og også et tiende frivillig år .

source: Nu ahte ollu guhkkelii mánát jovdet ja ollu buorebut máhttet sihke dárogiela ja eará fágaid maid .
nob: Slik at barna når mye lengre og kan mye bedre norsk og også andre fag .

source: Muhto lea okta jearaldat : lea go dat doarvái buorre ?
nob: Men det er et spørsmål : er det godt nok ?

source: Lea go skuvla nu buorre go sáhtášii šaddat ?
nob: Er skolen så god som den kan bli ?

source: Mii oaivvildit , ahte dat ii leat .
nob: Vi mener at den ikke er det .

source: Mis leat dakkár geahččaleamit mat leat miehtá Norgga .
nob: Vi har slike prøver som er over hele Norge .

source: Mii sáhttit geahččalit daid dáppe sámemánáid siste ja mii gávnnahit dan , ahte eai dat mánát joavdda nu guhkás go galggaše .
nob: Vi kan holde prøver her blant samebarna og vi finner ut at disse barna ikke når så langt som de skulle .

source: Ja de ferte dieđusge dakkaviđe jearrat : manne dat eai joavdda nu guhkás ?
nob: Og så må man sjølsagt straks spørre : hvorfor når de ikke så langt ?

source: Lea go boastut oppa min oahpahanvuohki ?
nob: Er det noe galt med hele undervisningsmåten vår ?

source: Mii doaivut , ahte dat lea boastut ja dál čakčat ( 1967 ) áigut geahččalit ođđa vuogi .
nob: Vi tror at den er feil , og nå i høst ( 1967 ) skal vi prøve en ny metode .

source: Dán rádjái lea leamaš nu ahte , go sámemánát leat boahtán skuvlii , de leat ožžon sámegiela veahkkegiellan : oahpaheaddji lea geavahan dan go lea dárbbašuvvon ; muhto dat leat oahppan sihke rehkenastit ja maiddái lohkat dárogillii ovttatmano .
nob: Til nå har det vært slik , at når samebarna har kommet til skolen , så har de fått samisk som hjelpespråk . Læreren har brukt det når det har trengtes , men de har lært både å regne og også å lese på norsk med en gang .

source: Ovtta gaskka mii geahččaleimmet dan láhkái , ahte mii oahpaheimmet guovtti gillii lohkat seammás , muhto dát orui menddo váttis guovtti gillii .
nob: Ei stund forsøkte vi på den måten at vi underviste i lesing på to språk samtidig , men det syntest å være alt for vanskelig på to språk .

source: Ja de mii manaimet fas dárogillii , ja dál mii leat geahččalan dušše oahpahit njuolga .
nob: Og så gikk vi igjen tilbake til norsk , og nå har vi forsøkt å bare undervise direkte .

source: Mii áigut dál geahččalit oahpahit mánáid eatnigillii álggus .
nob: Vi vil nå forsøkte å undervise barna på morsmålet i starten .

source: Dat galget oahppat lohkat ja čállit dan álgočállaga eatnigillii ja dárogiela oahppat njálmmálaččat .
nob: De skal lære å lese og skrive først på morsmålet og så lære norsk muntlig .

source: Ja dasto , go leat ožžon dan mađe sániid dárogielas , ahte sáhttet veaháš čállit , dalle easka galget álgit lohkat dárogiela maiddái .
nob: Og deretter , når de har fått såpass mange ord på norsk at de kan skrive litt , først da skal de lese norsk også .

source: Mun doaivvun , ahte dát vuohki lea buoret , muhto eat mii dieđe ovdal go leat geahččalan .
nob: Jeg tror at den måten er bedre , men vi vet ikke før vi har prøvd .

source: - Lea go leamaš stuorra beroštupmi dasa ahte oažžut sámegiela oahppangiellan ?
nob: - Har det vært stor interesse for å få samisk som undervisningsspråk ?

source: - Ii leat leamaš stuorra beroštupmi ja dat boahtá várra das , go váhnemat dáppe lohket , ahte " dalle go mii vácciimet skuvlla , oahpahuvvui beare sámegillii , mii logaimet beare sámegiela , ja oaidnit dál odne : mii eat máhte dárogiela eat veaháge . "
nob: - Det har ikke vært stor interesse og det kommer kanskje av at foreldrene her sier at " da vi gikk på skolen , lærte vi bare samisk . Vi leste bare samisk og se nå i dag : vi kan ikke det minste norsk . "

source: Dat soaitá gal , ahte dat lei boastut dalle go lei uhccán skuvlaáigi ja ollu fágat ja ollu maid čađa mannat , ahte oahpaheaddjit menddo ollu sámegiela geavahedje , ja menddo unnán dárogiela .
nob: Det kan kanskje være at det var galt den gang det var kort skoletid og mange fag og mye som man skulle gjennomgå , at lærerne brukte for mye samisk , og for lite norsk .

source: Muhto dál lea áibbas eará .
nob: Men nå er det noe helt annet .

source: Dál lea golmma geardde nu guhkes skuvlaáigi ja vel golbma jagi lassánan dat áigi , nu ahte dál mis lea dilli váldit sámegiela fárrui .
nob: Nå er det tre ganger så lang skoletid og denne er enda forlenga med 2-3 år , slik at vi nå har anledning til å ta samisken med .

source: Ja okta lea vel dat , ahte jos vuosttaš klássa mánná ii máhte dárogiela ja oahpaheaddji ii máhte sámegiela , de dat bázahallá áibbas dat mánná .
nob: Og en ting til er at når barn i første klasse ikke kan norsk og læreren ikke kan samisk , så bli det barnet hengende helt etter .

source: Dat ii ádde rehkega iige eará ovttage fága maid oahpaheaddji oahpaha dáppe .
nob: Det forstår ikke regning eller noe annet fag som læreren underviser .

source: Ja fertejit eará ohppiid dahje skuvlamánáid , mat seammá klássas vázzet , dulkan geavahit , jos dat máhttet veaháš dárogiela .
nob: Og da må andre elever i samme klasse brukes som tolk , dersom de kan litt norsk .

source: Na , dan gal juohkehaš diehtá makkáraš dulkkat dat leat !
nob: Og alle kan tenke seg hva slags tolker det blir !

source: Mun jáhkán , ahte jos dál manná nu go mii doaivut , de dat šaddá ollu buoret mánáide , sihkkarit .
nob: Jeg tror at dersom det nå går som vi tror , så vil det sikkert bli mye bedre for barna .

source: Dat ohppet ollu eambbo dárogiela ja ohppet ollu eambbo obanassiige , go lea álgán oahpahuvvot álggus sámegillii .
nob: De lærer mye mer norsk , og lærer mye mer i det hele tatt , når de fra først har begynt å lære på samisk .

source: - Leat go dis dál oahpahangirjjit sámegillii ?
nob: - Har dere nå lærebøker på samisk ?

source: - De aiddo dál ( 1967 ) leat boahtimin dat vuosttaš áppesat dahje oahpahangirjjit vuosttaš klássii ja dat leat ráhkaduvvon daid buot maŋimus ja ođđaseamos vugiid mielde .
nob: - Nettopp nå ( 1967 ) kommer de første ABC-ene eller lærebøkene for første klasse og de er laga etter de aller siste og nyeste metoder .

source: Muhto , oainnat , lea maiddái vihtta diimmu vahkkus njálmmálaš dárogieloahpahus ja dasa maid galggaše girjjit , oahpaheaddjái goit juobe .
nob: Men det er også 4-5 timer i uka med muntlig norskundervisning , og til det skal det også være bøker , i alle fall for læreren .

source: Dat ii leat oidnon vel , muhto dat lea lohpiduvvon , ahte dat galgá leat gárvvis čakčii .
nob: Det har vi ikke sett noe til ennå , men det er lova at disse bøkene skal være klare til høsten .

source: - Movt lei orron ovdal ?
nob: - Hvordan har det vært før ?

source: Leat go mánát ožžon lohkat sámekultuvrra birra ?
nob: Har barna fått lese om samekulturen ?

source: - Sámegieloahpahus lea gal ovdal nai leamaš .
nob: - Samiskopplæring har det også vært tidligere .

source: Dan " linjedelte ( suorgejuhkkojuvvon ) ungdomskuvllas " , dahje nuoraidskuvllas , sámemánát leat maŋimus jagiid beassan lohkat sámegillii sámekultuvrra birra čihččet , gávccát ja ovccát jagi .
nob: På den " linjedelte ungdomskolen " har samebarn de siste åra fått lese på samisk om samekulturen , i sjuende , åttende og niende året .

source: Dat leat eanáš lohkan Johan Turi girjjis " Muitalus sámiid birra " .
nob: De har for det meste lest i boka " Mui ' talus sámiid birra " av Johan Turi .

source: Muhto eai dat leat dán rádjái buohkat sáhttán válljet sámegiela .
nob: Men fram til nå har ikke alle kunnet velge samisk .

source: - Leat go sámemánát beassan oahppat juoigat nai skuvllas ?
nob: - Har samebarna også fått lære å joike på skolen ?

source: - Eai , diet lea hirbmat váttis gažaldat .
nob: - Nei , det der er et veldig vanskelig spørsmål .

source: Mun lean dan oaivilis , ahte berrešedje oahppat juoigat skuvllas , muhto die lea fas go váhnemat nu mannet vuostá .
nob: Jeg er av den mening at de burde lære å joike på skolen , men det har igjen foreldrene gått imot .

source: Mii leat gal geahččalan ávžžuhit sin ja muitalit , ahte juoigan lea seammá go misge lea Norggas álbmotmusihkka , ja muhtimat gal mannet dasa mielde , muhto leat olus mat eai sáhte dasa mannat mielde , ahte mii galgat oahpahit juoigat skuvllas .
nob: Vi har forsøkt å foreslå det og fortelle at joik er det samme som folkemusikken i Norge , og noen er med på det , men det er mange som ikke kan være med på at vi skal undervise i å joike på skolen . Det kommer for det meste av det at joik alltid har vært brukt i fylla og i slike negative sammenhenger .

source: Muhto mun jáhkán , ahte dađi mielde go bajásčuvgehus lassána ja stuorru , de mun doaivvun , ahte juoigan maid boahtá skuvlii .
nob: Men jeg tror at etter hvert som opplysninga øker , så har jeg håp om at joiking også kommer inn i skolen .

source: - Gávdnojit go dál oahpaheaddjit , mat máhttet oahpahit sámegillii , mat máhttet juoigat ja mat máhttet muđui sámekultuvrra birra muitalit mánáide ?
nob: - Finnes det nå lærere som kan undervise på samisk , som kan joike og som ellers kan fortelle barna om samekulturen ?

source: - Mun sáhtán ovdamearkka buktit dáppe Kárášjogas odne .
nob: - Jeg kan ta et eksempel fra her i Karasjok i dag .

source: Mis leat dál njealljelogivihtta oahpaheaddji min skuvllain ja vihtta-guhttanuppelohkái sámegielalaš oahpaheaddji , ja gal dat dieđusge eanáš dain máhttet oahpahit sámegiela .
nob: Vi har nå 45 lærere på skolen vår . 15-16 av dem er samiskspråklige , og flertallet av dem kan undervise på samisk .

source: Dat boahtá dás , ahte eanáš dain sámi oahpaheddjiin leat studeren sámegiela Oslo universitehtas .
nob: Det kommer av at de fleste av de samiske lærerne har studert samisk på universitetet i Oslo .

source: Dat bođii moadde jagi dás ovdal dakkár mearrádus , ahte sámegielat oahpaheaddjit , mat dáhttot studeret sámegiela Oslo universitehtas , sii ožžot bálkká dan áiggis , ja dat leat máŋggas mat leat vázzán dan oahpu ja leat ferten čatnat iežaset dán gildii viđa jahkái .
nob: For noen år siden kom det en bestemmelse om at samiske lærere , som vil studere samisk på Universitetet i Oslo , får lønn i studietida . Det er mange som har tatt det studiet og har måttet binde seg til kommunen i fem år .

source: Ja de , nu go olmmoš lea leamaš vihtta jagi ovtta sajis , na dat lea measta dego darvánan dasa .
nob: Og når man så har vært i fem år på et sted , har man nesten grodd fast der .

source: - Gávdnojit go dáppe maid oahpaheaddjit nu go sámi giehtadujiide ?
nob: - Finnes det også lærere i slikt som samisk handarbeid ?

source: - Juo , dat gávdnojit maid .
nob: - Ja , det finnes også .

source: Dat leat maid muhtimat , mat leat daid erenoamášskuvllaid vázzán , muhto dieđusge ii gávdno dakkár oahpaheaiskuvla sámedujiid várás : dat duoddjeoahpaheaddjit leat ieža bargan ja oahppan sámedujiid dahkat ja oahpahit .
nob: Det er også noen som har gått spesialskoler , men sjølsagt finnes det ikke noen slik lærerskole for samisk husflid . Disse handarbeidslærerne har sjøl arbeida og lært seg å lage og undervise i samisk handarbeid .

source: - Na , maid don jáhkát sámeskuvlla boahtteáiggis ?
nob: - Nå , hva tror du om framtida til sameskolen ?

source: - Mun bohten deike oahpaheaddjin 1953:s , ja dalle lohke buohkat , ahte ovtta logi jagi geažes de lea sámegiella jávkan .
nob: - Jeg kom hit som lærer i 1953 , og da sa alle at innen ti år så er samisk språk forsvunnet .

source: Muhto go mun dál geahčan klássalisttaide , de oainnán , ahte dat leat ollu eambbo sámegielalaččat dál go dalle ledje , nu ahte ii dat dáppe gal oro mannamin maŋás muhto ovddas .
nob: Men når jeg nå ser på klasselistene , så ser jeg at det er mange flere samisktalende nå enn det var dengang , slik at her synes det ikke å gå bakover , men framover .

source: Sámegielhállit lassánit .
nob: Tallet på samisktalende øker .

source: Oainnat , dat leat ollu mánát sápmelaččain .
nob: Samene har jo mange barn .

source: Čájehuvvo maiddái , ahte dat sámenuorat , mat leat geargan ovccijahkásaš skuvllas ja máhtte dárogiela áibbas čielgasit go gerge skuvllain , dat geavahit sámegiela seammá láhkái go ovdal , go dat bohtet ruoktut ja dáppe márkanis maid nu .
nob: Det viser seg også at de samebarna som har fullført 9-årig skole og kunnet norsk helt klart når de har gått ut av skolen , de bruker samisk på samme vis som før , både når de kommer hjem og også her i bygda .

source: Nu ahte mun in jáhke gal , ahte dat manná nu beare johtilit gal maŋás .
nob: Slik at jeg tror nok ikke at det går så raskt tilbake .

source: Ja mun doaivvun vel , ahte jos eiseválddit dahket vel veaháš , veahkehit nu ahte dat sáhttet bisuhit gielaset , de dalle dat gal bissu .
nob: Og jeg tror også at dersom myndighetene gjør litt , hjelper til slik at samene kan bevare språket sitt , så vil det bestå .

source: - Jáhkát go , ahte lea ollu áhpu ahte iežas eatnigiella oahpahuvvo skuvllas ?
nob: - Tror du at det er mye nytte i at morsmålet blir undervist i skolen ?

source: - Dat lea áhpu .
nob: - Det nytter .

source: Buot geahppaseamos dieđusge livččii dadjat : " Mii eat dárbbaš dan sámegiela , mii álgit dál buohkat dárogiela hállat . "
nob: Det aller letteste ville sjølsagt vært å si : " Vi trenger ikke den samisken , nå begynner vi alle å snakke norsk " .

source: Dat livččii hui álki .
nob: Det ville vært svært lett .

source: Muhto lea olmmošvuoigatvuohta hállat dan giela maid ieš háliida .
nob: Men det er en menneskerett å snakke det språket man sjøv vil .

source: Ja lea stáhta ja min skuvlaeiseválddiid geatnegasvuohta ráhkadit skuvlla dan láhkái , ahte buohkat sáhttet dan giela válljet , mii heive buoremusat sidjiide .
nob: Og det er statens og våre skolemyndigheters plikt å lage skolen slik at alle kan velge det språket som er best for dem.

source: Muhto dán rádjái ii leat nu leamaš .
nob: Men til nå har det ikke vært slik .
